{
  "module": "keras.src.models.functional",
  "class_name": "Functional",
  "config": {
    "name": "functional",
    "trainable": true,
    "layers": [
      {
        "module": "keras.layers",
        "class_name": "InputLayer",
        "config": {
          "batch_shape": [null, null, 32],
          "dtype": "float32",
          "sparse": false,
          "name": "input_layer"
        },
        "registered_name": null,
        "name": "input_layer",
        "inbound_nodes": []
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "units": 32,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": { "seed": null },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, null, 32] },
        "name": "dense",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, null, 32],
                  "dtype": "float32",
                  "keras_history": ["input_layer", 0, 0]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.src.ops.numpy",
        "class_name": "Add",
        "config": { "name": "add" },
        "registered_name": "Add",
        "name": "add",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, null, 32],
                  "dtype": "float32",
                  "keras_history": ["dense", 0, 0]
                }
              },
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, null, 32],
                  "dtype": "float32",
                  "keras_history": ["dense", 0, 0]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_1",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "units": 32,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": { "seed": null },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, null, 32] },
        "name": "dense_1",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, null, 32],
                  "dtype": "float32",
                  "keras_history": ["input_layer", 0, 0]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.src.ops.numpy",
        "class_name": "Add",
        "config": { "name": "add_1" },
        "registered_name": "Add",
        "name": "add_1",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, null, 32],
                  "dtype": "float32",
                  "keras_history": ["add", 0, 0]
                }
              },
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, null, 32],
                  "dtype": "float32",
                  "keras_history": ["dense_1", 0, 0]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.src.ops.numpy",
        "class_name": "Subtract",
        "config": { "name": "subtract" },
        "registered_name": "Subtract",
        "name": "subtract",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, null, 32],
                  "dtype": "float32",
                  "keras_history": ["add_1", 0, 0]
                }
              },
              5
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.src.ops.numpy",
        "class_name": "Multiply",
        "config": { "name": "multiply" },
        "registered_name": "Multiply",
        "name": "multiply",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, null, 32],
                  "dtype": "float32",
                  "keras_history": ["subtract", 0, 0]
                }
              },
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, null, 32],
                  "dtype": "float32",
                  "keras_history": ["dense_1", 0, 0]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_2",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "units": 32,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": { "seed": null },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, null, 32] },
        "name": "dense_2",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, null, 32],
                  "dtype": "float32",
                  "keras_history": ["multiply", 0, 0]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      }
    ],
    "input_layers": [["input_layer", 0, 0]],
    "output_layers": [["dense_2", 0, 0]]
  },
  "registered_name": "Functional",
  "build_config": { "input_shape": null },
  "compile_config": {
    "optimizer": {
      "module": "keras.optimizers",
      "class_name": "RMSprop",
      "config": {
        "name": "rmsprop",
        "learning_rate": 0.0010000000474974513,
        "weight_decay": null,
        "clipnorm": null,
        "global_clipnorm": null,
        "clipvalue": null,
        "use_ema": false,
        "ema_momentum": 0.99,
        "ema_overwrite_frequency": null,
        "loss_scale_factor": null,
        "gradient_accumulation_steps": null,
        "rho": 0.9,
        "momentum": 0.0,
        "epsilon": 1e-7,
        "centered": false
      },
      "registered_name": null
    },
    "loss": null,
    "loss_weights": null,
    "metrics": null,
    "weighted_metrics": null,
    "run_eagerly": false,
    "steps_per_execution": 1,
    "jit_compile": false
  }
}
