{
  "module": "keras.src.models.functional",
  "class_name": "Functional",
  "config": {
    "name": "MobileNetV3Small",
    "trainable": true,
    "layers": [
      {
        "module": "keras.layers",
        "class_name": "InputLayer",
        "config": {
          "batch_shape": [null, null, null, 3],
          "dtype": "float32",
          "sparse": false,
          "name": "input_layer"
        },
        "registered_name": null,
        "name": "input_layer",
        "inbound_nodes": []
      },
      {
        "module": "keras.layers",
        "class_name": "Rescaling",
        "config": {
          "name": "rescaling",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "scale": 0.00784313725490196,
          "offset": -1.0
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, null, null, 3] },
        "name": "rescaling",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, null, null, 3],
                  "dtype": "float32",
                  "keras_history": ["input_layer", 0, 0]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Conv2D",
        "config": {
          "name": "conv",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "filters": 16,
          "kernel_size": [3, 3],
          "strides": [2, 2],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": { "seed": null },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, null, null, 3] },
        "name": "conv",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, null, null, 3],
                  "dtype": "float32",
                  "keras_history": ["rescaling", 0, 0]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "BatchNormalization",
        "config": {
          "name": "conv_bn",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "axis": -1,
          "momentum": 0.999,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "gamma_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "moving_mean_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "moving_variance_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null,
          "synchronized": false
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, null, null, 16] },
        "name": "conv_bn",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, null, null, 16],
                  "dtype": "float32",
                  "keras_history": ["conv", 0, 0]
                }
              }
            ],
            "kwargs": { "mask": null }
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Activation",
        "config": {
          "name": "activation",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "activation": "hard_silu"
        },
        "registered_name": null,
        "name": "activation",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, null, null, 16],
                  "dtype": "float32",
                  "keras_history": ["conv_bn", 0, 0]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "ZeroPadding2D",
        "config": {
          "name": "expanded_conv_depthwise_pad",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "padding": [
            [0, 1],
            [0, 1]
          ],
          "data_format": "channels_last"
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, null, null, 16] },
        "name": "expanded_conv_depthwise_pad",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, null, null, 16],
                  "dtype": "float32",
                  "keras_history": ["activation", 0, 0]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "DepthwiseConv2D",
        "config": {
          "name": "expanded_conv_depthwise",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "depth_multiplier": 1,
          "kernel_size": [3, 3],
          "strides": [2, 2],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "activation": "linear",
          "use_bias": false,
          "depthwise_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": { "seed": null },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "depthwise_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "depthwise_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, null, null, 16] },
        "name": "expanded_conv_depthwise",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, null, null, 16],
                  "dtype": "float32",
                  "keras_history": ["expanded_conv_depthwise_pad", 0, 0]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "BatchNormalization",
        "config": {
          "name": "expanded_conv_depthwise_bn",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "axis": -1,
          "momentum": 0.999,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "gamma_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "moving_mean_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "moving_variance_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null,
          "synchronized": false
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, null, null, 16] },
        "name": "expanded_conv_depthwise_bn",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, null, null, 16],
                  "dtype": "float32",
                  "keras_history": ["expanded_conv_depthwise", 0, 0]
                }
              }
            ],
            "kwargs": { "mask": null }
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "ReLU",
        "config": {
          "name": "re_lu",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "max_value": null,
          "negative_slope": 0.0,
          "threshold": 0.0
        },
        "registered_name": null,
        "name": "re_lu",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, null, null, 16],
                  "dtype": "float32",
                  "keras_history": ["expanded_conv_depthwise_bn", 0, 0]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "GlobalAveragePooling2D",
        "config": {
          "name": "expanded_conv_squeeze_excite_avg_pool",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "data_format": "channels_last",
          "keepdims": true
        },
        "registered_name": null,
        "name": "expanded_conv_squeeze_excite_avg_pool",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, null, null, 16],
                  "dtype": "float32",
                  "keras_history": ["re_lu", 0, 0]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Conv2D",
        "config": {
          "name": "expanded_conv_squeeze_excite_conv",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "filters": 8,
          "kernel_size": [1, 1],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": { "seed": null },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, 1, 1, 16] },
        "name": "expanded_conv_squeeze_excite_conv",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, 1, 1, 16],
                  "dtype": "float32",
                  "keras_history": [
                    "expanded_conv_squeeze_excite_avg_pool",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "ReLU",
        "config": {
          "name": "expanded_conv_squeeze_excite_relu",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "max_value": null,
          "negative_slope": 0.0,
          "threshold": 0.0
        },
        "registered_name": null,
        "name": "expanded_conv_squeeze_excite_relu",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, 1, 1, 8],
                  "dtype": "float32",
                  "keras_history": ["expanded_conv_squeeze_excite_conv", 0, 0]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Conv2D",
        "config": {
          "name": "expanded_conv_squeeze_excite_conv_1",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "filters": 16,
          "kernel_size": [1, 1],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": { "seed": null },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, 1, 1, 8] },
        "name": "expanded_conv_squeeze_excite_conv_1",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, 1, 1, 8],
                  "dtype": "float32",
                  "keras_history": ["expanded_conv_squeeze_excite_relu", 0, 0]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.src.ops.numpy",
        "class_name": "Add",
        "config": { "name": "add" },
        "registered_name": "Add",
        "name": "add",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, 1, 1, 16],
                  "dtype": "float32",
                  "keras_history": ["expanded_conv_squeeze_excite_conv_1", 0, 0]
                }
              },
              3.0
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "ReLU",
        "config": {
          "name": "re_lu_1",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "max_value": 6.0,
          "negative_slope": 0.0,
          "threshold": 0.0
        },
        "registered_name": null,
        "name": "re_lu_1",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, 1, 1, 16],
                  "dtype": "float32",
                  "keras_history": ["add", 0, 0]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.src.ops.numpy",
        "class_name": "Multiply",
        "config": { "name": "multiply" },
        "registered_name": "Multiply",
        "name": "multiply",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, 1, 1, 16],
                  "dtype": "float32",
                  "keras_history": ["re_lu_1", 0, 0]
                }
              },
              0.16666666666666666
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Multiply",
        "config": {
          "name": "expanded_conv_squeeze_excite_mul",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          }
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            [null, null, null, 16],
            [null, 1, 1, 16]
          ]
        },
        "name": "expanded_conv_squeeze_excite_mul",
        "inbound_nodes": [
          {
            "args": [
              [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [null, null, null, 16],
                    "dtype": "float32",
                    "keras_history": ["re_lu", 0, 0]
                  }
                },
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [null, 1, 1, 16],
                    "dtype": "float32",
                    "keras_history": ["multiply", 0, 0]
                  }
                }
              ]
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Conv2D",
        "config": {
          "name": "expanded_conv_project",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "filters": 16,
          "kernel_size": [1, 1],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": { "seed": null },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, null, null, 16] },
        "name": "expanded_conv_project",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, null, null, 16],
                  "dtype": "float32",
                  "keras_history": ["expanded_conv_squeeze_excite_mul", 0, 0]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "BatchNormalization",
        "config": {
          "name": "expanded_conv_project_bn",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "axis": -1,
          "momentum": 0.999,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "gamma_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "moving_mean_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "moving_variance_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null,
          "synchronized": false
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, null, null, 16] },
        "name": "expanded_conv_project_bn",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, null, null, 16],
                  "dtype": "float32",
                  "keras_history": ["expanded_conv_project", 0, 0]
                }
              }
            ],
            "kwargs": { "mask": null }
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Conv2D",
        "config": {
          "name": "expanded_conv_1_expand",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "filters": 72,
          "kernel_size": [1, 1],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": { "seed": null },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, null, null, 16] },
        "name": "expanded_conv_1_expand",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, null, null, 16],
                  "dtype": "float32",
                  "keras_history": ["expanded_conv_project_bn", 0, 0]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "BatchNormalization",
        "config": {
          "name": "expanded_conv_1_expand_bn",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "axis": -1,
          "momentum": 0.999,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "gamma_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "moving_mean_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "moving_variance_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null,
          "synchronized": false
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, null, null, 72] },
        "name": "expanded_conv_1_expand_bn",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, null, null, 72],
                  "dtype": "float32",
                  "keras_history": ["expanded_conv_1_expand", 0, 0]
                }
              }
            ],
            "kwargs": { "mask": null }
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "ReLU",
        "config": {
          "name": "re_lu_2",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "max_value": null,
          "negative_slope": 0.0,
          "threshold": 0.0
        },
        "registered_name": null,
        "name": "re_lu_2",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, null, null, 72],
                  "dtype": "float32",
                  "keras_history": ["expanded_conv_1_expand_bn", 0, 0]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "ZeroPadding2D",
        "config": {
          "name": "expanded_conv_1_depthwise_pad",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "padding": [
            [0, 1],
            [0, 1]
          ],
          "data_format": "channels_last"
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, null, null, 72] },
        "name": "expanded_conv_1_depthwise_pad",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, null, null, 72],
                  "dtype": "float32",
                  "keras_history": ["re_lu_2", 0, 0]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "DepthwiseConv2D",
        "config": {
          "name": "expanded_conv_1_depthwise",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "depth_multiplier": 1,
          "kernel_size": [3, 3],
          "strides": [2, 2],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "activation": "linear",
          "use_bias": false,
          "depthwise_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": { "seed": null },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "depthwise_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "depthwise_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, null, null, 72] },
        "name": "expanded_conv_1_depthwise",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, null, null, 72],
                  "dtype": "float32",
                  "keras_history": ["expanded_conv_1_depthwise_pad", 0, 0]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "BatchNormalization",
        "config": {
          "name": "expanded_conv_1_depthwise_bn",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "axis": -1,
          "momentum": 0.999,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "gamma_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "moving_mean_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "moving_variance_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null,
          "synchronized": false
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, null, null, 72] },
        "name": "expanded_conv_1_depthwise_bn",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, null, null, 72],
                  "dtype": "float32",
                  "keras_history": ["expanded_conv_1_depthwise", 0, 0]
                }
              }
            ],
            "kwargs": { "mask": null }
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "ReLU",
        "config": {
          "name": "re_lu_3",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "max_value": null,
          "negative_slope": 0.0,
          "threshold": 0.0
        },
        "registered_name": null,
        "name": "re_lu_3",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, null, null, 72],
                  "dtype": "float32",
                  "keras_history": ["expanded_conv_1_depthwise_bn", 0, 0]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Conv2D",
        "config": {
          "name": "expanded_conv_1_project",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "filters": 24,
          "kernel_size": [1, 1],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": { "seed": null },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, null, null, 72] },
        "name": "expanded_conv_1_project",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, null, null, 72],
                  "dtype": "float32",
                  "keras_history": ["re_lu_3", 0, 0]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "BatchNormalization",
        "config": {
          "name": "expanded_conv_1_project_bn",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "axis": -1,
          "momentum": 0.999,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "gamma_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "moving_mean_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "moving_variance_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null,
          "synchronized": false
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, null, null, 24] },
        "name": "expanded_conv_1_project_bn",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, null, null, 24],
                  "dtype": "float32",
                  "keras_history": ["expanded_conv_1_project", 0, 0]
                }
              }
            ],
            "kwargs": { "mask": null }
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Conv2D",
        "config": {
          "name": "expanded_conv_2_expand",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "filters": 88,
          "kernel_size": [1, 1],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": { "seed": null },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, null, null, 24] },
        "name": "expanded_conv_2_expand",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, null, null, 24],
                  "dtype": "float32",
                  "keras_history": ["expanded_conv_1_project_bn", 0, 0]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "BatchNormalization",
        "config": {
          "name": "expanded_conv_2_expand_bn",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "axis": -1,
          "momentum": 0.999,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "gamma_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "moving_mean_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "moving_variance_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null,
          "synchronized": false
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, null, null, 88] },
        "name": "expanded_conv_2_expand_bn",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, null, null, 88],
                  "dtype": "float32",
                  "keras_history": ["expanded_conv_2_expand", 0, 0]
                }
              }
            ],
            "kwargs": { "mask": null }
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "ReLU",
        "config": {
          "name": "re_lu_4",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "max_value": null,
          "negative_slope": 0.0,
          "threshold": 0.0
        },
        "registered_name": null,
        "name": "re_lu_4",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, null, null, 88],
                  "dtype": "float32",
                  "keras_history": ["expanded_conv_2_expand_bn", 0, 0]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "DepthwiseConv2D",
        "config": {
          "name": "expanded_conv_2_depthwise",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "depth_multiplier": 1,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "activation": "linear",
          "use_bias": false,
          "depthwise_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": { "seed": null },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "depthwise_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "depthwise_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, null, null, 88] },
        "name": "expanded_conv_2_depthwise",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, null, null, 88],
                  "dtype": "float32",
                  "keras_history": ["re_lu_4", 0, 0]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "BatchNormalization",
        "config": {
          "name": "expanded_conv_2_depthwise_bn",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "axis": -1,
          "momentum": 0.999,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "gamma_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "moving_mean_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "moving_variance_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null,
          "synchronized": false
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, null, null, 88] },
        "name": "expanded_conv_2_depthwise_bn",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, null, null, 88],
                  "dtype": "float32",
                  "keras_history": ["expanded_conv_2_depthwise", 0, 0]
                }
              }
            ],
            "kwargs": { "mask": null }
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "ReLU",
        "config": {
          "name": "re_lu_5",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "max_value": null,
          "negative_slope": 0.0,
          "threshold": 0.0
        },
        "registered_name": null,
        "name": "re_lu_5",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, null, null, 88],
                  "dtype": "float32",
                  "keras_history": ["expanded_conv_2_depthwise_bn", 0, 0]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Conv2D",
        "config": {
          "name": "expanded_conv_2_project",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "filters": 24,
          "kernel_size": [1, 1],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": { "seed": null },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, null, null, 88] },
        "name": "expanded_conv_2_project",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
