{
  "module": "keras.src.models.functional",
  "class_name": "Functional",
  "config": {
    "name": "functional_7",
    "trainable": true,
    "layers": [
      {
        "module": "keras.layers",
        "class_name": "InputLayer",
        "config": {
          "batch_shape": [null, 28, 28],
          "dtype": "float32",
          "sparse": false,
          "name": "input_layer"
        },
        "registered_name": null,
        "name": "input_layer",
        "inbound_nodes": []
      },
      {
        "module": "keras",
        "class_name": "Sequential",
        "config": {
          "name": "preprocess",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "layers": [
            {
              "module": "keras.layers",
              "class_name": "InputLayer",
              "config": {
                "batch_shape": [null, 28, 28],
                "dtype": "float32",
                "sparse": false,
                "name": "input_layer_1"
              },
              "registered_name": null
            },
            {
              "module": "keras.layers",
              "class_name": "Rescaling",
              "config": {
                "name": "rescaling",
                "trainable": true,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": { "name": "float32" },
                  "registered_name": null
                },
                "scale": 0.00392156862745098,
                "offset": 0.0
              },
              "registered_name": null,
              "build_config": { "input_shape": [null, 28, 28] }
            },
            {
              "module": "keras.layers",
              "class_name": "Flatten",
              "config": {
                "name": "flatten",
                "trainable": true,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": { "name": "float32" },
                  "registered_name": null
                },
                "data_format": "channels_last"
              },
              "registered_name": null,
              "build_config": { "input_shape": [null, 28, 28] }
            }
          ],
          "build_input_shape": [null, 28, 28]
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, 28, 28] },
        "name": "preprocess",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, 28, 28],
                  "dtype": "float32",
                  "keras_history": ["input_layer", 0, 0]
                }
              }
            ],
            "kwargs": { "mask": null }
          }
        ]
      },
      {
        "module": "keras",
        "class_name": "Sequential",
        "config": {
          "name": "second",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "layers": [
            {
              "module": "keras.layers",
              "class_name": "InputLayer",
              "config": {
                "batch_shape": [null, 784],
                "dtype": "float32",
                "sparse": false,
                "name": "input_layer_3"
              },
              "registered_name": null
            },
            {
              "module": "keras.layers",
              "class_name": "Dense",
              "config": {
                "name": "dense_2",
                "trainable": true,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": { "name": "float32" },
                  "registered_name": null
                },
                "units": 64,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": { "seed": null },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {},
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "registered_name": null,
              "build_config": { "input_shape": [null, 784] }
            },
            {
              "module": "keras.layers",
              "class_name": "Dense",
              "config": {
                "name": "dense_3",
                "trainable": true,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": { "name": "float32" },
                  "registered_name": null
                },
                "units": 32,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": { "seed": null },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {},
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "registered_name": null,
              "build_config": { "input_shape": [null, 64] }
            }
          ],
          "build_input_shape": [null, 784]
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, 784] },
        "name": "second",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, 784],
                  "dtype": "float32",
                  "keras_history": ["preprocess", 0, 0]
                }
              }
            ],
            "kwargs": { "mask": null }
          }
        ]
      },
      {
        "module": "keras",
        "class_name": "Sequential",
        "config": {
          "name": "first",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "layers": [
            {
              "module": "keras.layers",
              "class_name": "InputLayer",
              "config": {
                "batch_shape": [null, 784],
                "dtype": "float32",
                "sparse": false,
                "name": "input_layer_2"
              },
              "registered_name": null
            },
            {
              "module": "keras.layers",
              "class_name": "Dense",
              "config": {
                "name": "dense",
                "trainable": true,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": { "name": "float32" },
                  "registered_name": null
                },
                "units": 64,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": { "seed": null },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {},
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "registered_name": null,
              "build_config": { "input_shape": [null, 784] }
            },
            {
              "module": "keras.layers",
              "class_name": "Dense",
              "config": {
                "name": "dense_1",
                "trainable": true,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": { "name": "float32" },
                  "registered_name": null
                },
                "units": 32,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": { "seed": null },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {},
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "registered_name": null,
              "build_config": { "input_shape": [null, 64] }
            }
          ],
          "build_input_shape": [null, 784]
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, 784] },
        "name": "first",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, 784],
                  "dtype": "float32",
                  "keras_history": ["preprocess", 0, 0]
                }
              }
            ],
            "kwargs": { "mask": null }
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Add",
        "config": {
          "name": "add",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          }
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            [null, 32],
            [null, 32]
          ]
        },
        "name": "add",
        "inbound_nodes": [
          {
            "args": [
              [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [null, 32],
                    "dtype": "float32",
                    "keras_history": ["first", 0, 0]
                  }
                },
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [null, 32],
                    "dtype": "float32",
                    "keras_history": ["second", 0, 0]
                  }
                }
              ]
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras",
        "class_name": "Sequential",
        "config": {
          "name": "third",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "layers": [
            {
              "module": "keras.layers",
              "class_name": "InputLayer",
              "config": {
                "batch_shape": [null, 32],
                "dtype": "float32",
                "sparse": false,
                "name": "input_layer_4"
              },
              "registered_name": null
            },
            {
              "module": "keras.layers",
              "class_name": "Dense",
              "config": {
                "name": "dense_4",
                "trainable": true,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": { "name": "float32" },
                  "registered_name": null
                },
                "units": 32,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": { "seed": null },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {},
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "registered_name": null,
              "build_config": { "input_shape": [null, 32] }
            },
            {
              "module": "keras.layers",
              "class_name": "Dense",
              "config": {
                "name": "dense_5",
                "trainable": true,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": { "name": "float32" },
                  "registered_name": null
                },
                "units": 32,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": { "seed": null },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {},
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "registered_name": null,
              "build_config": { "input_shape": [null, 32] }
            }
          ],
          "build_input_shape": [null, 32]
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, 32] },
        "name": "third",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, 32],
                  "dtype": "float32",
                  "keras_history": ["add", 0, 0]
                }
              }
            ],
            "kwargs": { "mask": null }
          }
        ]
      },
      {
        "module": "keras",
        "class_name": "Sequential",
        "config": {
          "name": "forth",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "layers": [
            {
              "module": "keras.layers",
              "class_name": "InputLayer",
              "config": {
                "batch_shape": [null, 32],
                "dtype": "float32",
                "sparse": false,
                "name": "input_layer_5"
              },
              "registered_name": null
            },
            {
              "module": "keras.layers",
              "class_name": "Dense",
              "config": {
                "name": "dense_6",
                "trainable": true,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": { "name": "float32" },
                  "registered_name": null
                },
                "units": 32,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": { "seed": null },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {},
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "registered_name": null,
              "build_config": { "input_shape": [null, 32] }
            },
            {
              "module": "keras.layers",
              "class_name": "Dense",
              "config": {
                "name": "dense_7",
                "trainable": true,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": { "name": "float32" },
                  "registered_name": null
                },
                "units": 32,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": { "seed": null },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {},
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "registered_name": null,
              "build_config": { "input_shape": [null, 32] }
            }
          ],
          "build_input_shape": [null, 32]
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, 32] },
        "name": "forth",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, 32],
                  "dtype": "float32",
                  "keras_history": ["third", 0, 0]
                }
              }
            ],
            "kwargs": { "mask": null }
          }
        ]
      },
      {
        "module": "keras",
        "class_name": "Sequential",
        "config": {
          "name": "fifth",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "layers": [
            {
              "module": "keras.layers",
              "class_name": "InputLayer",
              "config": {
                "batch_shape": [null, 32],
                "dtype": "float32",
                "sparse": false,
                "name": "input_layer_6"
              },
              "registered_name": null
            },
            {
              "module": "keras.layers",
              "class_name": "Dense",
              "config": {
                "name": "dense_8",
                "trainable": true,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": { "name": "float32" },
                  "registered_name": null
                },
                "units": 64,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": { "seed": null },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {},
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "registered_name": null,
              "build_config": { "input_shape": [null, 32] }
            },
            {
              "module": "keras.layers",
              "class_name": "Dense",
              "config": {
                "name": "dense_9",
                "trainable": true,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": { "name": "float32" },
                  "registered_name": null
                },
                "units": 32,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": { "seed": null },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {},
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "registered_name": null,
              "build_config": { "input_shape": [null, 64] }
            }
          ],
          "build_input_shape": [null, 32]
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, 32] },
        "name": "fifth",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, 32],
                  "dtype": "float32",
                  "keras_history": ["third", 0, 0]
                }
              }
            ],
            "kwargs": { "mask": null }
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Add",
        "config": {
          "name": "add_1",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          }
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            [null, 32],
            [null, 32],
            [null, 32]
          ]
        },
        "name": "add_1",
        "inbound_nodes": [
          {
            "args": [
              [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [null, 32],
                    "dtype": "float32",
                    "keras_history": ["second", 0, 0]
                  }
                },
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [null, 32],
                    "dtype": "float32",
                    "keras_history": ["forth", 0, 0]
                  }
                },
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [null, 32],
                    "dtype": "float32",
                    "keras_history": ["fifth", 0, 0]
                  }
                }
              ]
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras",
        "class_name": "Sequential",
        "config": {
          "name": "out",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "layers": [
            {
              "module": "keras.layers",
              "class_name": "InputLayer",
              "config": {
                "batch_shape": [null, 32],
                "dtype": "float32",
                "sparse": false,
                "name": "input_layer_7"
              },
              "registered_name": null
            },
            {
              "module": "keras.layers",
              "class_name": "Dense",
              "config": {
                "name": "dense_10",
                "trainable": true,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": { "name": "float32" },
                  "registered_name": null
                },
                "units": 32,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": { "seed": null },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {},
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "registered_name": null,
              "build_config": { "input_shape": [null, 32] }
            },
            {
              "module": "keras.layers",
              "class_name": "Dense",
              "config": {
                "name": "dense_11",
                "trainable": true,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": { "name": "float32" },
                  "registered_name": null
                },
                "units": 10,
                "activation": "softmax",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": { "seed": null },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {},
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "registered_name": null,
              "build_config": { "input_shape": [null, 32] }
            }
          ],
          "build_input_shape": [null, 32]
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, 32] },
        "name": "out",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [null, 32],
                  "dtype": "float32",
                  "keras_history": ["add_1", 0, 0]
                }
              }
            ],
            "kwargs": { "mask": null }
          }
        ]
      }
    ],
    "input_layers": [["input_layer", 0, 0]],
    "output_layers": [["out", 0, 0]]
  },
  "registered_name": "Functional",
  "build_config": { "input_shape": null },
  "compile_config": {
    "optimizer": {
      "module": "keras.optimizers",
      "class_name": "Adam",
      "config": {
        "name": "adam",
        "learning_rate": 0.0010000000474974513,
        "weight_decay": null,
        "clipnorm": null,
        "global_clipnorm": null,
        "clipvalue": null,
        "use_ema": false,
        "ema_momentum": 0.99,
        "ema_overwrite_frequency": null,
        "loss_scale_factor": null,
        "gradient_accumulation_steps": null,
        "beta_1": 0.9,
        "beta_2": 0.999,
        "epsilon": 1e-7,
        "amsgrad": false
      },
      "registered_name": null
    },
    "loss": "sparse_categorical_crossentropy",
    "loss_weights": null,
    "metrics": ["accuracy"],
    "weighted_metrics": null,
    "run_eagerly": false,
    "steps_per_execution": 1,
    "jit_compile": false
  }
}
